---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralBeamStartAttachmentType
source: html/55e2a838-c440-e170-91fd-fd02ea3f730d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralBeamStartAttachmentType Property

"Start Attachment Type"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralBeamStartAttachmentType { get; }
```